# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'

# Binaries
brew 'antigen'
brew 'bat'
brew 'caddy'
brew 'circleci'
brew 'deno'
brew 'fzf'
brew 'gnupg2'
brew 'gh'
brew 'git'
brew 'jq'
brew 'pinentry-mac'
brew 'ripgrep'
brew 'rust'
brew 'swiftlint'
brew 'swiftformat'
brew 'tokei'
brew 'watch'
brew 'node'
brew 'yarn'
brew 'mas' # Mac App Store manager

# Apps
cask '1password'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'gpg-suite'
cask 'slack'
cask 'steam'
cask 'telegram'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'spotify'
cask 'spectacle'
cask 'rescuetime'
cask 'postman'
cask 'appcleaner'

# Fonts
cask 'font-fira-code'

# Mac App Store
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Messenger', id: 1480068668
mas 'Todoist', id: 585829637
mas 'Bear', id: 1091189122
mas 'DaisyDisk', id: 411643860
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'iStat Menus', id: 1319778037
mas 'The Unarchiver', id: 425424353
